# Day 22

## Pandas
Pandas is also known as Data Manuplation tool.

- It's a python library that is used while you are working with the datasets.

- It has some functions:
  - 1. Explore 
  - 2. Manipulation 
  - 3. Cleaning
  - 4. Analyze



-  Why Pandas?
  - It allows us to analyse big datas. ( data that is so large, fast or complex that it's difficult or impossible to process using traditional methods )
  
  - It is used to clean messy datasets and then make it readable and relevant.

# The more our data is relevant the more the accuracy of the model.

In [105]:
# Dataaset --> table (rows and columns)
# A dataset contain multiple datapoints
# Datapoint --> particular row

### Importation of Pandas

In [226]:
import pandas as pd
import warnings
warnings.filterwarnings(action = 'ignore')

In [107]:

pd. __version__

'1.5.3'

## Pandas Data Structure

1. Series
2. Dataframe
3. Panel

Pandas DS are very fast because it is bulilt on top of numpy array

1. Series --> Dimensions ( Columns)
2. Dataframe --> Dimension (Rows and columns)
3. Panel --> Dataframe (3-Dimensionl, Representing the 3-D in 2-D plane is very difficult.)

## 1. Series

1. It is a 1-Dimensional array like Datastructure (DS)
2. [1,2,3,4,5,6,8,9] --> column

SYNATX : pd.Series (data, index, dtype)
- You can create a series by using various input datas such as:
    - 1. Array
    - 2. Dictionary
    - 3. Scalar value.

### Creating an empty series:

In [108]:
s = pd.Series()
s

C:\Users\Shree\AppData\Local\Temp\ipykernel_14724\3032608601.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

Series([], dtype: float64)

### Creating the series using numpy array

- If we are accessing the
  - Row --> Index
  - Columns --> Column value(Name).

In [109]:
import numpy as np
data = np.array([12,45,32,89])
s = pd.Series(data)
s

0    12
1    45
2    32
3    89
dtype: int32

- If we want to change the index value then we can use the index function or if we want to acces only the data from specific index we can call a index function.

In [110]:
data = np.array([12,45,32,89])
s = pd.Series(data,index =[101,102,103,104])
s

101    12
102    45
103    32
104    89
dtype: int32

### Creating the Series using Dictionary.

In [111]:
data = ({'a':10, 'b':20, "c":90, 'd':95})
s = pd.Series(data) 
s

a    10
b    20
c    90
d    95
dtype: int64

- If we want to change the index value then we can use the index function or if we want to acces only the data from specific index we can call a index function.

In [112]:
data = ({'a':10, 'b':20, "c":90, 'd':95})
s = pd.Series(data,index = ['f','g','h','i']) 
s

f   NaN
g   NaN
h   NaN
i   NaN
dtype: float64

In [113]:
data = ({'a':10, 'b':20, "c":90, 'd':95})
s = pd.Series(data,index = ['c','d','e','b','a']) 
s

c    90.0
d    95.0
e     NaN
b    20.0
a    10.0
dtype: float64

### Creating the series using Scalar Value.

In [114]:
data = 99
s = pd.Series(data,index = [102,102,103,104,105,106])
s

102    99
102    99
103    99
104    99
105    99
106    99
dtype: int64

## U --> Updation
1. Accessing the data from the Pandas Series DS

In [115]:
data = np.array([12,45,32,89,7,-10,21,-0.5,-7,30])
s = pd.Series(data)
s

0    12.0
1    45.0
2    32.0
3    89.0
4     7.0
5   -10.0
6    21.0
7    -0.5
8    -7.0
9    30.0
dtype: float64

In [116]:
s[0:3]

0    12.0
1    45.0
2    32.0
dtype: float64

In [117]:
s[-3:]

7    -0.5
8    -7.0
9    30.0
dtype: float64

In [118]:
data = ({'a':10, 'b':20, "c":90, 'd':95})
s = pd.Series(data,index = ['c','d','e','b','a']) 
s

c    90.0
d    95.0
e     NaN
b    20.0
a    10.0
dtype: float64

- While performing with the list the stoping index will not be including. 
- But while performing with dict the stoping index will be including.

In [119]:
s['d':'a']

d    95.0
e     NaN
b    20.0
a    10.0
dtype: float64

In [120]:
s[['c','b']]

c    90.0
b    20.0
dtype: float64

In [121]:
s[{'c','b'}]

C:\Users\Shree\AppData\Local\Temp\ipykernel_14724\900033985.py:1: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  s[{'c','b'}]

c    90.0
b    20.0
dtype: float64

In [122]:
s
# If we want to change the e value = 85.5

c    90.0
d    95.0
e     NaN
b    20.0
a    10.0
dtype: float64

In [123]:
s['e'] = 85.5
s

c    90.0
d    95.0
e    85.5
b    20.0
a    10.0
dtype: float64

### Boolean Masking
  - 0 - Flase
  - 1 - True

In [124]:
s > 50

c     True
d     True
e     True
b    False
a    False
dtype: bool

In [125]:
# This is how we will call the values which are satisfying the certain condition
s[s>50]

c    90.0
d    95.0
e    85.5
dtype: float64

In [126]:
# print all the values >90 and also print the value 10 for "s" dataset.
# s [s>90 and s==10]

In [127]:
s.shape

(5,)

In [128]:
s.ndim

1

In [129]:
s.size

5

In [130]:
s.index

Index(['c', 'd', 'e', 'b', 'a'], dtype='object')

In [131]:
s.values
# Decimal --> 3
# Float --> 5.688888

array([90. , 95. , 85.5, 20. , 10. ])

## Delete

In [132]:
s

c    90.0
d    95.0
e    85.5
b    20.0
a    10.0
dtype: float64

In [133]:
# it is temp deletion
s.drop(['c','d'])

e    85.5
b    20.0
a    10.0
dtype: float64

In [134]:
# for permanat delete
s.drop('a',inplace=True)

In [135]:
s

c    90.0
d    95.0
e    85.5
b    20.0
dtype: float64

# Day 23

## 2. DataFrame 

1. It is a 2-D Datastructure (DS).\
It has rows and columns.
2. SYNTAX : pd.DataFrame (data, index, columns, dtype, copy)

### CRUD Operations

In [136]:
import pandas as pd

- C --> Create

1. List
2. Dict
3. nd.array
4. Series
5. Another DataFrame

#### 1.Empty DataFrame

In [137]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

#### 2.Create A DataFrame using List

In [138]:
data = [7,8,44,56,23,98]
df = pd.DataFrame(data)
df

    0
0   7
1   8
2  44
3  56
4  23
5  98

In [139]:
df.shape

(6, 1)

In [140]:
data = [["Dog", "Bhaw bhaw"],["Cat", "Meow"], ['Cow', 'Moo']]
df = pd.DataFrame (data)
df

     0          1
0  Dog  Bhaw bhaw
1  Cat       Meow
2  Cow        Moo

In [141]:
# Giving the column name insted of 0 and 1
data = [["Dog", "Bhaw bhaw"],["Cat", "Meow"], ['Cow', 'Moo']]
df = pd.DataFrame (data, columns = ["Animal_name", "Animal_sound"])
df

  Animal_name Animal_sound
0         Dog    Bhaw bhaw
1         Cat         Meow
2         Cow          Moo

#### 3.dic

In [142]:
data ={'Name' : ["Ram", "Rahul", 'Bhwan'], 'Age': [25,20,18]}
df = pd.DataFrame (data)
df

    Name  Age
0    Ram   25
1  Rahul   20
2  Bhwan   18

In [143]:
# Renaming of the index
data ={'Name' : ["Ram", "Rahul", 'Bhwan'], 'Age': [25,20,18]}
df = pd.DataFrame (data,index = ["A", 'B', 'C'])
df

    Name  Age
A    Ram   25
B  Rahul   20
C  Bhwan   18

#### 4.Create DataFrame using series

In [144]:
# Creating different dataset using series
data ={'Karan_marks':pd.Series([50, 77, 65], index = ["Test1", 'Test2', "Test3"]),
       " Arjun_marks": pd.Series([67,89,32,98,51],index = ["Test1", 'Test2', "Test3",'Test4','Test5'])}
df = pd.DataFrame (data)
df

       Karan_marks   Arjun_marks
Test1         50.0            67
Test2         77.0            89
Test3         65.0            32
Test4          NaN            98
Test5          NaN            51

In [145]:
data ={'Karan_marks':pd.Series([50, 77, 65], index = ["Test1", 'Test2', "Test3"]),
       " Arjun_marks": pd.Series([67,89,32,98,51],index = ["Test1", 'Test2', "Test3",'Test4','Test5'])}
df = pd.DataFrame (data, columns = ["A", "B"],index = ["AA", "AB"])
df

# If Columns headings are changed to A & B and all the vlaues --> NaN 
# Its same as the series
# If only columns headings are changed and A & B but the data remains the same.
# Column Overwriiting is possible in the Columns

      A    B
AA  NaN  NaN
AB  NaN  NaN

#### 5.Creat a DataFrame from List of Dict.

In [146]:
data = [{'A':1,"B":2},{"C":3,"D":4},{"E":5,"F":6}]
df = pd.DataFrame (data)
df

     A    B    C    D    E    F
0  1.0  2.0  NaN  NaN  NaN  NaN
1  NaN  NaN  3.0  4.0  NaN  NaN
2  NaN  NaN  NaN  NaN  5.0  6.0

In [147]:
# Changing the Index value.
data = [{'A':1,"B":2},{"C":3,"D":4},{"E":5,"F":6}]
df = pd.DataFrame (data, index =['X', 'Y', 'Z'])
df

     A    B    C    D    E    F
X  1.0  2.0  NaN  NaN  NaN  NaN
Y  NaN  NaN  3.0  4.0  NaN  NaN
Z  NaN  NaN  NaN  NaN  5.0  6.0

In [148]:
#  If we change the column name in df then it will create the different data
data = [{'A':1,"B":2},{"C":3,"D":4},{"E":5,"F":6}]
df = pd.DataFrame (data, index =['X', 'Y', 'Z'], columns = ['x', 'y', 'z','l','m'])
df

    x   y   z   l   m
X NaN NaN NaN NaN NaN
Y NaN NaN NaN NaN NaN
Z NaN NaN NaN NaN NaN

### U - Update

In [149]:
data = [10,20,30,40,50,60,70,80]
data1 = [100,200,300,400,500,600,700,800]
df = pd.DataFrame ([data,data1], columns =['A',"B","C","D","E","F","G","H"])
df

     A    B    C    D    E    F    G    H
0   10   20   30   40   50   60   70   80
1  100  200  300  400  500  600  700  800

#### 1.Column Selection

In [150]:
df['F']

0     60
1    600
Name: F, dtype: int64

#### 2.Adding new column in DF

In [151]:
df["I"] = [86,880]
df

     A    B    C    D    E    F    G    H    I
0   10   20   30   40   50   60   70   80   86
1  100  200  300  400  500  600  700  800  880

In [152]:
# The size of perticular table won't allow me to add the three elements. 
df["M"] = pd.Series ([56,78,89])
df

     A    B    C    D    E    F    G    H    I   M
0   10   20   30   40   50   60   70   80   86  56
1  100  200  300  400  500  600  700  800  880  78

In [153]:
# Series allow me to write 1 element in index0 in the dataframe and it gives us the NaN value on index1
df["N"] = pd.Series ([56])
df

     A    B    C    D    E    F    G    H    I   M     N
0   10   20   30   40   50   60   70   80   86  56  56.0
1  100  200  300  400  500  600  700  800  880  78   NaN

In [154]:
df["O"] = pd.Series ([1,2,3,4], index = [0,1,2,3])
df

     A    B    C    D    E    F    G    H    I   M     N  O
0   10   20   30   40   50   60   70   80   86  56  56.0  1
1  100  200  300  400  500  600  700  800  880  78   NaN  2

In [155]:
df ['Y'] = pd.Series([1,2,3,4], index = ['A','B','C','D'])
df

     A    B    C    D    E    F    G    H    I   M     N  O   Y
0   10   20   30   40   50   60   70   80   86  56  56.0  1 NaN
1  100  200  300  400  500  600  700  800  880  78   NaN  2 NaN

#### 3.Delete a column

In [156]:
df

     A    B    C    D    E    F    G    H    I   M     N  O   Y
0   10   20   30   40   50   60   70   80   86  56  56.0  1 NaN
1  100  200  300  400  500  600  700  800  880  78   NaN  2 NaN

In [157]:
# Using the del keyword
del df['G']
df

     A    B    C    D    E    F    H    I   M     N  O   Y
0   10   20   30   40   50   60   80   86  56  56.0  1 NaN
1  100  200  300  400  500  600  800  880  78   NaN  2 NaN

In [158]:
# pop function
df.pop ('Y')
df

     A    B    C    D    E    F    H    I   M     N  O
0   10   20   30   40   50   60   80   86  56  56.0  1
1  100  200  300  400  500  600  800  880  78   NaN  2

- If we are using del and pop we can only delet single column from the data.

In [159]:
df['C']

0     30
1    300
Name: C, dtype: int64

In [160]:
df [['C']]

     C
0   30
1  300

In [161]:
# If I want to see column E A & N
df[['E',"A",'N']]

     E    A     N
0   50   10  56.0
1  500  100   NaN

In [162]:
df

     A    B    C    D    E    F    H    I   M     N  O
0   10   20   30   40   50   60   80   86  56  56.0  1
1  100  200  300  400  500  600  800  880  78   NaN  2

In [163]:
# if i want to delet I and O
# drop for multiple columns
# axis 1 = column, axis 0 = row
# it will be temp delete

df.drop(["I","O"],axis = 1)

     A    B    C    D    E    F    H   M     N
0   10   20   30   40   50   60   80  56  56.0
1  100  200  300  400  500  600  800  78   NaN

In [164]:
df ["P"] = df['E'] + df['N']
df
# 0 != Null, Void, NaN

     A    B    C    D    E    F    H    I   M     N  O      P
0   10   20   30   40   50   60   80   86  56  56.0  1  106.0
1  100  200  300  400  500  600  800  880  78   NaN  2    NaN

In [165]:
df

     A    B    C    D    E    F    H    I   M     N  O      P
0   10   20   30   40   50   60   80   86  56  56.0  1  106.0
1  100  200  300  400  500  600  800  880  78   NaN  2    NaN

In [166]:
df1 = [{"A":45,"B":98,"P":104}]

In [167]:
df = df.append(df1)
df

C:\Users\Shree\AppData\Local\Temp\ipykernel_14724\1156893483.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df1)

     A    B      C      D      E      F      H      I     M     N    O      P
0   10   20   30.0   40.0   50.0   60.0   80.0   86.0  56.0  56.0  1.0  106.0
1  100  200  300.0  400.0  500.0  600.0  800.0  880.0  78.0   NaN  2.0    NaN
0   45   98    NaN    NaN    NaN    NaN    NaN    NaN   NaN   NaN  NaN  104.0

In [168]:
df = pd.DataFrame (df1, index = ['Hey'])
df

      A   B    P
Hey  45  98  104

In [169]:
df = pd.DataFrame (df1)
df

    A   B    P
0  45  98  104

In [170]:
# Add a column = Hello, with value = 130
df['Hello'] = 130
df

    A   B    P  Hello
0  45  98  104    130

In [171]:
# create a new column in 2nd position 'bye'
# df.insert(location, name_of_column, data)
df.insert(2,'Bye',[100])

In [172]:
df

    A   B  Bye    P  Hello
0  45  98  100  104    130

In [173]:
df.insert(2,'Bank',200)

In [174]:
df

    A   B  Bank  Bye    P  Hello
0  45  98   200  100  104    130

# Day 24

In [175]:
import pandas as pd

In [181]:
data = {'Apples':[102, 500, 250, 75],"Grapes":[50, 150, 90, 45]}
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D'])
df

   Apples  Grapes
A     102      50
B     500     150
C     250      90
D      75      45

In [182]:
df[['Grapes']]

   Grapes
A      50
B     150
C      90
D      45

In [183]:
df ["Bananas"] = df["Grapes"] + 50
df

   Apples  Grapes  Bananas
A     102      50      100
B     500     150      200
C     250      90      140
D      75      45       95

- As drop function is not a parmenent delete so to make it permenent delet we can use ( inplace = True ) function.

In [179]:
df.drop(['Bananas'],axis = 1,inplace = True)
# Inplace will do the changes in the original dataset.
df

   Apples  Grapes
A     102      50
B     500     150
C     250      90
D      75      45

## Row - CRUD

In [184]:
df['Pear'] = df ['Bananas'] + 100
df['Mangoes'] = df ['Pear'] + 500
df['Jackfruit'] = df ['Grapes'] + 150
df['Strawberry'] = df ['Jackfruit'] + 200
df['Oranges'] = df ['Strawberry'] + 70

In [185]:
df

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50      100   200      700        200         400      470
B     500     150      200   300      800        300         500      570
C     250      90      140   240      740        240         440      510
D      75      45       95   195      695        195         395      465

### Row Selection
- loc & iloc

In [186]:
# If i want to select row3
# loc --> works with the index name
df.loc[['D']]

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45       95   195      695        195         395      465

In [187]:
# In the lock it will include the starting and the ending point.
df.loc['A':'D']

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50      100   200      700        200         400      470
B     500     150      200   300      800        300         500      570
C     250      90      140   240      740        240         440      510
D      75      45       95   195      695        195         395      465

In [188]:
# iloc --> it will take the index.
df.iloc[[-1]]

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
D      75      45       95   195      695        195         395      465

In [189]:
df.iloc[2:3]

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
C     250      90      140   240      740        240         440      510

### Row Addition

In [190]:
Student_marks = {'Name': ["Rahul", 'Rohit', "Venkat",'Sahil','Ankita'],
                 'OS': [25, 75.5,96,0,100],
                 "DBMS": [20,80,60,50,99]}
        
df1 = pd.DataFrame(Student_marks)
df1

     Name     OS  DBMS
0   Rahul   25.0    20
1   Rohit   75.5    80
2  Venkat   96.0    60
3   Sahil    0.0    50
4  Ankita  100.0    99

#### 1.append

In [191]:
data2 = {"Name":'Robby', "OS": 60.5, "DBMS": 55.5}

In [192]:
# 2st method fro row addition
df1 = df1.append(data2,ignore_index = True)
df1

C:\Users\Shree\AppData\Local\Temp\ipykernel_14724\681358049.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(data2,ignore_index = True)

     Name     OS  DBMS
0   Rahul   25.0  20.0
1   Rohit   75.5  80.0
2  Venkat   96.0  60.0
3   Sahil    0.0  50.0
4  Ankita  100.0  99.0
5   Robby   60.5  55.5

#### 2.Concat

In [193]:
# 2nd method for row addition
data3 = {"Name":'Venom', "OS": 80.5, "DBMS": 75}

df3 = pd.DataFrame(data3, index = [0])
df3

    Name    OS  DBMS
0  Venom  80.5    75

In [194]:
df1 = pd.concat([df3,df1], ignore_index = True)
df1

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Sahil    0.0  50.0
5  Ankita  100.0  99.0
6   Robby   60.5  55.5

In [195]:
df1.iloc[[0]]

    Name    OS  DBMS
0  Venom  80.5  75.0

In [196]:
df1.loc[[4]]

    Name   OS  DBMS
4  Sahil  0.0  50.0

- Updating the Index

In [197]:
df1.loc[4] = ['Steve',67,23]
df1

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0
6   Robby   60.5  55.5

### Row Delete

- del and pop only works in column deletion not in row deletion

In [198]:
df1.drop(6)

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0

In [199]:
df1.drop(6,inplace = True) #For permenent delete

In [200]:
df1

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0

## Pandas
- Data Exploration - checking rows,columns,null values. 
- Data Cleaning -
- Data Manuplation -
- Data Analysis -

### Data Exploration

- head ( )
- tail ( )
- dtypes 
- empty  - To check the detaframe is empty or not.
- ndim 
- shape
- size
- values - It will return in array in 2-D
- describe ( )
- T - transpose
- sum ( )
- mean ( )
- median ( )
- mode ( )
- std - Standaard deviation
- min ( )
- max ( )
- cumsum ()
- cumprod ( )

In [227]:
df1  # Population --> (Superset of all the Sample)

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0

In [228]:
# Sample --> (Subset of population)
df1.head()

     Name    OS  DBMS
0   Venom  80.5  75.0
1   Rahul  25.0  20.0
2   Rohit  75.5  80.0
3  Venkat  96.0  60.0
4   Steve  67.0  23.0

In [229]:
df.tail()

   Apples  Grapes  Bananas  Pear  Mangoes  Jackfruit  Strawberry  Oranges
A     102      50      100   200      700        200         400      470
B     500     150      200   300      800        300         500      570
C     250      90      140   240      740        240         440      510
D      75      45       95   195      695        195         395      465

In [230]:
df1.dtypes

Name     object
OS      float64
DBMS    float64
dtype: object

In [231]:
df1.empty

False

In [232]:
df.ndim

2

In [233]:
df1.shape

(6, 3)

In [234]:
df1.size

18

In [235]:
df1.values

array([['Venom', 80.5, 75.0],
       ['Rahul', 25.0, 20.0],
       ['Rohit', 75.5, 80.0],
       ['Venkat', 96.0, 60.0],
       ['Steve', 67.0, 23.0],
       ['Ankita', 100.0, 99.0]], dtype=object)

In [236]:
df1.describe()
# 25, 60,75 is the cortile values

               OS       DBMS
count    6.000000   6.000000
mean    74.000000  59.500000
std     27.035162  31.979681
min     25.000000  20.000000
25%     69.125000  32.250000
50%     78.000000  67.500000
75%     92.125000  78.750000
max    100.000000  99.000000

In [237]:
df1.T # it is a temp change.

          0      1      2       3      4       5
Name  Venom  Rahul  Rohit  Venkat  Steve  Ankita
OS     80.5   25.0   75.5    96.0   67.0   100.0
DBMS   75.0   20.0   80.0    60.0   23.0    99.0

In [238]:
df1.iloc[2]

Name    Rohit
OS       75.5
DBMS     80.0
Name: 2, dtype: object

In [239]:
ad = df1.T
ad

          0      1      2       3      4       5
Name  Venom  Rahul  Rohit  Venkat  Steve  Ankita
OS     80.5   25.0   75.5    96.0   67.0   100.0
DBMS   75.0   20.0   80.0    60.0   23.0    99.0

In [240]:
ad.iloc[1]

0     80.5
1     25.0
2     75.5
3     96.0
4     67.0
5    100.0
Name: OS, dtype: object

In [241]:
df1.sum()
# It will going to concatinate all the dataframe

Name    VenomRahulRohitVenkatSteveAnkita
OS                                 444.0
DBMS                               357.0
dtype: object

In [242]:
df1['OS'].sum()

444.0

In [243]:
df1['DBMS'].sum()

357.0

In [244]:
print (df1,'\n')
df1.sum(1) # 1 --> Axis
# It will sum all the row and print out the output.

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0

0    155.5
1     45.0
2    155.5
3    156.0
4     90.0
5    199.0
dtype: float64

In [245]:
df1.mean()

OS      74.0
DBMS    59.5
dtype: float64

In [246]:
  df1.mean(1)

0    77.75
1    22.50
2    77.75
3    78.00
4    45.00
5    99.50
dtype: float64

In [247]:
df1.median()

OS      78.0
DBMS    67.5
dtype: float64

In [248]:
df1

     Name     OS  DBMS
0   Venom   80.5  75.0
1   Rahul   25.0  20.0
2   Rohit   75.5  80.0
3  Venkat   96.0  60.0
4   Steve   67.0  23.0
5  Ankita  100.0  99.0

In [249]:
df1.mode() 
# if there will be no repeted values all the data will get sorted in ascending order

     Name     OS  DBMS
0  Ankita   25.0  20.0
1   Rahul   67.0  23.0
2   Rohit   75.5  60.0
3   Steve   80.5  75.0
4  Venkat   96.0  80.0
5   Venom  100.0  99.0

In [250]:
df1.std()

OS      27.035162
DBMS    31.979681
dtype: float64

In [253]:
df1.std(1)

0     3.889087
1     3.535534
2     3.181981
3    25.455844
4    31.112698
5     0.707107
dtype: float64

In [254]:
df1.min()

Name    Ankita
OS        25.0
DBMS      20.0
dtype: object

In [255]:
df1.max()

Name    Venom
OS      100.0
DBMS     99.0
dtype: object

In [256]:
df1.min(1)

0    75.0
1    20.0
2    75.5
3    60.0
4    23.0
5    99.0
dtype: float64

In [257]:
df1.max(1)

0     80.5
1     25.0
2     80.0
3     96.0
4     67.0
5    100.0
dtype: float64

In [258]:
df1.cumsum()

                               Name     OS   DBMS
0                             Venom   80.5   75.0
1                        VenomRahul  105.5   95.0
2                   VenomRahulRohit  181.0  175.0
3             VenomRahulRohitVenkat  277.0  235.0
4        VenomRahulRohitVenkatSteve  344.0  258.0
5  VenomRahulRohitVenkatSteveAnkita  444.0  357.0

# Day 25

## Data Cleaning and Data Manipulation

In [259]:
import numpy as np
import pandas as pd

In [260]:
data1 = np.random.rand(10,3)
data2 = np.random.rand(7,3)

In [261]:
df1 = pd.DataFrame(data1, columns =['col1','col2','col3'])
df2 = pd.DataFrame(data2, columns =['col1','col2','col3'])

In [262]:
df1

       col1      col2      col3
0  0.787881  0.206257  0.453105
1  0.425835  0.559122  0.913961
2  0.064862  0.726644  0.057390
3  0.739837  0.863452  0.371117
4  0.857346  0.032999  0.125343
5  0.926936  0.569222  0.692944
6  0.844903  0.913935  0.458493
7  0.045321  0.287195  0.450833
8  0.712175  0.442347  0.969196
9  0.983448  0.511809  0.573865

In [263]:
df2

       col1      col2      col3
0  0.234919  0.044510  0.440413
1  0.042301  0.204663  0.875775
2  0.544399  0.317039  0.352392
3  0.434936  0.799592  0.867572
4  0.691188  0.693963  0.247958
5  0.474674  0.734125  0.044502
6  0.231282  0.580525  0.063928

In [264]:
df3 = pd.concat([df1,df2],ignore_index = True)
df3

        col1      col2      col3
0   0.787881  0.206257  0.453105
1   0.425835  0.559122  0.913961
2   0.064862  0.726644  0.057390
3   0.739837  0.863452  0.371117
4   0.857346  0.032999  0.125343
5   0.926936  0.569222  0.692944
6   0.844903  0.913935  0.458493
7   0.045321  0.287195  0.450833
8   0.712175  0.442347  0.969196
9   0.983448  0.511809  0.573865
10  0.234919  0.044510  0.440413
11  0.042301  0.204663  0.875775
12  0.544399  0.317039  0.352392
13  0.434936  0.799592  0.867572
14  0.691188  0.693963  0.247958
15  0.474674  0.734125  0.044502
16  0.231282  0.580525  0.063928

In [265]:
# if i want to call col3 in loop.
for i in df3.col3:
  print (i)

0.45310455169596153
0.9139606012677391
0.057389608755112564
0.3711174150931381
0.12534271190811253
0.6929444002255982
0.45849299217023953
0.45083285976926724
0.9691961860491067
0.5738650702144997
0.44041254502081184
0.8757752453180931
0.35239160122341573
0.8675720419647955
0.24795798401580216
0.04450207463295286
0.06392754595722705

### Iteritems

- for column

In [266]:
# if you have to iterate each column in loops.

for key, values in df3.iteritems():
  print (key,values)

col1 0     0.787881
1     0.425835
2     0.064862
3     0.739837
4     0.857346
5     0.926936
6     0.844903
7     0.045321
8     0.712175
9     0.983448
10    0.234919
11    0.042301
12    0.544399
13    0.434936
14    0.691188
15    0.474674
16    0.231282
Name: col1, dtype: float64
col2 0     0.206257
1     0.559122
2     0.726644
3     0.863452
4     0.032999
5     0.569222
6     0.913935
7     0.287195
8     0.442347
9     0.511809
10    0.044510
11    0.204663
12    0.317039
13    0.799592
14    0.693963
15    0.734125
16    0.580525
Name: col2, dtype: float64
col3 0     0.453105
1     0.913961
2     0.057390
3     0.371117
4     0.125343
5     0.692944
6     0.458493
7     0.450833
8     0.969196
9     0.573865
10    0.440413
11    0.875775
12    0.352392
13    0.867572
14    0.247958
15    0.044502
16    0.063928
Name: col3, dtype: float64

### iterrows

- if we want to iterate the rows.

In [267]:
for index, row in df3.iterrows():
  print (index, row)

0 col1    0.787881
col2    0.206257
col3    0.453105
Name: 0, dtype: float64
1 col1    0.425835
col2    0.559122
col3    0.913961
Name: 1, dtype: float64
2 col1    0.064862
col2    0.726644
col3    0.057390
Name: 2, dtype: float64
3 col1    0.739837
col2    0.863452
col3    0.371117
Name: 3, dtype: float64
4 col1    0.857346
col2    0.032999
col3    0.125343
Name: 4, dtype: float64
5 col1    0.926936
col2    0.569222
col3    0.692944
Name: 5, dtype: float64
6 col1    0.844903
col2    0.913935
col3    0.458493
Name: 6, dtype: float64
7 col1    0.045321
col2    0.287195
col3    0.450833
Name: 7, dtype: float64
8 col1    0.712175
col2    0.442347
col3    0.969196
Name: 8, dtype: float64
9 col1    0.983448
col2    0.511809
col3    0.573865
Name: 9, dtype: float64
10 col1    0.234919
col2    0.044510
col3    0.440413
Name: 10, dtype: float64
11 col1    0.042301
col2    0.204663
col3    0.875775
Name: 11, dtype: float64
12 col1    0.544399
col2    0.317039
col3    0.352392
Name: 12, dtype: float64
13 col1    0.434936
col2    0.799592
col3    0.867572
Name: 13, dtype: float64
14 col1    0.691188
col2    0.693963
col3    0.247958
Name: 14, dtype: float64
15 col1    0.474674
col2    0.734125
col3    0.044502
Name: 15, dtype: float64
16 col1    0.231282
col2    0.580525
col3    0.063928
Name: 16, dtype: float64

### sort - sort_index ( )

- Rows

In [268]:
unsorted_df = pd.DataFrame (np.random.rand(10,3),
                            index = [5,7,3,9,2,1,9,11,21,4],
                            columns = ['col1','col2','col3'])  

unsorted_df

        col1      col2      col3
5   0.269832  0.826161  0.331373
7   0.001054  0.304685  0.312490
3   0.203290  0.330149  0.418278
9   0.595823  0.392655  0.198027
2   0.403988  0.523430  0.399732
1   0.282858  0.967738  0.306247
9   0.475639  0.418365  0.545414
11  0.991630  0.560819  0.162634
21  0.901331  0.405263  0.927219
4   0.009828  0.641480  0.832129

In [269]:
unsorted_df.sort_index()

        col1      col2      col3
1   0.282858  0.967738  0.306247
2   0.403988  0.523430  0.399732
3   0.203290  0.330149  0.418278
4   0.009828  0.641480  0.832129
5   0.269832  0.826161  0.331373
7   0.001054  0.304685  0.312490
9   0.595823  0.392655  0.198027
9   0.475639  0.418365  0.545414
11  0.991630  0.560819  0.162634
21  0.901331  0.405263  0.927219

In [270]:
unsorted_df.sort_index(ascending = False)

        col1      col2      col3
21  0.901331  0.405263  0.927219
11  0.991630  0.560819  0.162634
9   0.595823  0.392655  0.198027
9   0.475639  0.418365  0.545414
7   0.001054  0.304685  0.312490
5   0.269832  0.826161  0.331373
4   0.009828  0.641480  0.832129
3   0.203290  0.330149  0.418278
2   0.403988  0.523430  0.399732
1   0.282858  0.967738  0.306247

- columns

In [271]:
unsorted_df.sort_index(axis = 1)

        col1      col2      col3
5   0.269832  0.826161  0.331373
7   0.001054  0.304685  0.312490
3   0.203290  0.330149  0.418278
9   0.595823  0.392655  0.198027
2   0.403988  0.523430  0.399732
1   0.282858  0.967738  0.306247
9   0.475639  0.418365  0.545414
11  0.991630  0.560819  0.162634
21  0.901331  0.405263  0.927219
4   0.009828  0.641480  0.832129

In [272]:
unsorted_df.sort_index(axis = 1,ascending = False)

        col3      col2      col1
5   0.331373  0.826161  0.269832
7   0.312490  0.304685  0.001054
3   0.418278  0.330149  0.203290
9   0.198027  0.392655  0.595823
2   0.399732  0.523430  0.403988
1   0.306247  0.967738  0.282858
9   0.545414  0.418365  0.475639
11  0.162634  0.560819  0.991630
21  0.927219  0.405263  0.901331
4   0.832129  0.641480  0.009828

### sort_values ( )

In [311]:
df = pd.DataFrame({"Apples":[50,95,105,75], "Grapes":[100,45,99,0]})
df

   Apples  Grapes
0      50     100
1      95      45
2     105      99
3      75       0

In [274]:
df.sort_values(by = ['Apples','Grapes'])

   Apples  Grapes
0      50     100
3      75       0
1      95      45
2     105      99

- sort_value using kind
    - types of kind:
      - Quicksort
      - Mergesort
      - Heapsort

In [275]:
df.sort_values(by = ['Apples','Grapes'],kind ='mergesort')

   Apples  Grapes
0      50     100
3      75       0
1      95      45
2     105      99

## Stast - Advance

In [276]:
df3

        col1      col2      col3
0   0.787881  0.206257  0.453105
1   0.425835  0.559122  0.913961
2   0.064862  0.726644  0.057390
3   0.739837  0.863452  0.371117
4   0.857346  0.032999  0.125343
5   0.926936  0.569222  0.692944
6   0.844903  0.913935  0.458493
7   0.045321  0.287195  0.450833
8   0.712175  0.442347  0.969196
9   0.983448  0.511809  0.573865
10  0.234919  0.044510  0.440413
11  0.042301  0.204663  0.875775
12  0.544399  0.317039  0.352392
13  0.434936  0.799592  0.867572
14  0.691188  0.693963  0.247958
15  0.474674  0.734125  0.044502
16  0.231282  0.580525  0.063928

In [277]:
df4 = df3.drop([8,9,10,11,12,13,14,15,16])
df4

       col1      col2      col3
0  0.787881  0.206257  0.453105
1  0.425835  0.559122  0.913961
2  0.064862  0.726644  0.057390
3  0.739837  0.863452  0.371117
4  0.857346  0.032999  0.125343
5  0.926936  0.569222  0.692944
6  0.844903  0.913935  0.458493
7  0.045321  0.287195  0.450833

## Covariance 
- cov ( )

In [278]:
df4['col2']

0    0.206257
1    0.559122
2    0.726644
3    0.863452
4    0.032999
5    0.569222
6    0.913935
7    0.287195
Name: col2, dtype: float64

In [279]:
df4.col2

0    0.206257
1    0.559122
2    0.726644
3    0.863452
4    0.032999
5    0.569222
6    0.913935
7    0.287195
Name: col2, dtype: float64

In [280]:
df4['col2'].cov(df4['col3'])

0.011737353644905505

In [281]:
# covarience of whole dataframe.
df4.cov()

          col1      col2      col3
col1  0.130127 -0.001708  0.016474
col2 -0.001708  0.101372  0.011737
col3  0.016474  0.011737  0.077056

## Correlation
- corr ()

In [282]:
# Correlation between columns
df4['col2'].corr(df4['col3'])

0.13280295629591402

In [283]:
# COrrelation of whole dataframe.
df4.corr()

          col1      col2      col3
col1  1.000000 -0.014875  0.164513
col2 -0.014875  1.000000  0.132803
col3  0.164513  0.132803  1.000000

### Correlation types:
- Pearson r correlation:
- Rank Correlation
- Spearmint correlation
- Spearman rank correlation

## Data Cleaning

In [284]:
df = pd.DataFrame(np.random.rand(5,3),
                  index =["A",'C','B','E','D'],
                  columns = ['col1','col2','col3'])
df

       col1      col2      col3
A  0.265447  0.168067  0.070290
C  0.034934  0.598406  0.693514
B  0.292694  0.983822  0.745113
E  0.240152  0.753745  0.998007
D  0.898112  0.299140  0.593300

In [285]:
df.sort_index()

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007

### Reindexing

In reindexing if we exceed our indexing value we will not get the error like us use to get before.\
Instead of getting error we will get the indexing with the NaN values.

In [286]:
df = df.reindex(['A','B','C','D','E','F','G','H','I'])
df

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

### isnull and isna

In [287]:
df.isnull()

    col1   col2   col3
A  False  False  False
B  False  False  False
C  False  False  False
D  False  False  False
E  False  False  False
F   True   True   True
G   True   True   True
H   True   True   True
I   True   True   True

In [288]:
df.isnull().sum()

col1    4
col2    4
col3    4
dtype: int64

In [289]:
df.isnull().sum().sum()

12

In [290]:
# Isnull can also check the null values by column
df['col1'].isnull()

A    False
B    False
C    False
D    False
E    False
F     True
G     True
H     True
I     True
Name: col1, dtype: bool

In [291]:
# Isnull for row null value check.
df.loc['G'].isnull ()

col1    True
col2    True
col3    True
Name: G, dtype: bool

In [292]:
df.isna()

    col1   col2   col3
A  False  False  False
B  False  False  False
C  False  False  False
D  False  False  False
E  False  False  False
F   True   True   True
G   True   True   True
H   True   True   True
I   True   True   True

### notnull - It will return the null values false.

In [293]:
df.notnull()

    col1   col2   col3
A   True   True   True
B   True   True   True
C   True   True   True
D   True   True   True
E   True   True   True
F  False  False  False
G  False  False  False
H  False  False  False
I  False  False  False

In [294]:
df.notnull().sum()

col1    5
col2    5
col3    5
dtype: int64

In [295]:
df.notnull().sum().sum()

15

In [296]:
df.count()
# It is going to show us not null values in dataframe.

col1    5
col2    5
col3    5
dtype: int64

## Cleaning Missing (NaN) Values.
-fillna ( )
  - we don't use fillna (int) much in projects

In [297]:
df

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

In [298]:
df.fillna(np.random.rand())

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F  0.842225  0.842225  0.842225
G  0.842225  0.842225  0.842225
H  0.842225  0.842225  0.842225
I  0.842225  0.842225  0.842225

### Types of methods:
- Forward Method
  - pad / ffill
- Backward Method
  - bfill / backfill

In [299]:
df

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

In [300]:
df.fillna(method='pad')

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F  0.240152  0.753745  0.998007
G  0.240152  0.753745  0.998007
H  0.240152  0.753745  0.998007
I  0.240152  0.753745  0.998007

In [301]:
# df.fillna(method='bfill') 
# as it is not working coz we dont have any last index with values

In [302]:
df.fillna(method ='pad', axis = 1)
# it will only work when there is some value befor nan values in the rows

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

### dropna ( )
The more the data the will be the accuracy so please try to avoid using the dropna function.

In [304]:
df.dropna()

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007

## Replacing the values
- replace ( )

In [305]:
df

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

In [306]:
df.replace({50:90, 99 : 245})

       col1      col2      col3
A  0.265447  0.168067  0.070290
B  0.292694  0.983822  0.745113
C  0.034934  0.598406  0.693514
D  0.898112  0.299140  0.593300
E  0.240152  0.753745  0.998007
F       NaN       NaN       NaN
G       NaN       NaN       NaN
H       NaN       NaN       NaN
I       NaN       NaN       NaN

In [307]:
df.replace({0.101609 : 10, 0.691288 : 123}).round(3)

    col1   col2   col3
A  0.265  0.168  0.070
B  0.293  0.984  0.745
C  0.035  0.598  0.694
D  0.898  0.299  0.593
E  0.240  0.754  0.998
F    NaN    NaN    NaN
G    NaN    NaN    NaN
H    NaN    NaN    NaN
I    NaN    NaN    NaN

In [312]:
df

   Apples  Grapes
0      50     100
1      95      45
2     105      99
3      75       0

In [313]:
# replace 105 without using any function
df.Apples.loc[2] = 500

In [314]:
df

   Apples  Grapes
0      50     100
1      95      45
2     500      99
3      75       0

In [315]:
df.Grapes.loc[2] = 299
df

   Apples  Grapes
0      50     100
1      95      45
2     500     299
3      75       0

## Handle Duplicates Values

Check the duplicate values
- duplicated ( )

In [316]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [317]:
# find out duplicate values in columns 
df.duplicated(subset = ['Apples'])

0    False
1    False
2    False
3    False
dtype: bool

- Remove Duplicate values
-drop_duplicates( )

it only use when we have same entry twice in the datasets.

In [318]:
df.drop_duplicates (subset = ['Apples'])

   Apples  Grapes
0      50     100
1      95      45
2     500     299
3      75       0

## Import & Export a Dataset

In [319]:
df = pd.read_csv("https://raw.githubusercontent.com/ShapeAI/Python-for-Data-Science-/master/stocks.csv")

In [320]:
df

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
...,...,...,...,...,...,...,...
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

When we are done with data cleaning visualization and prediction

When we want to export the data.

In [321]:
# pd.to_csv('Name_of_the_new_file.csv', 'Location')

In [322]:
df['Open'].nunique()

3208

In [323]:
df['Open'].unique

<bound method Series.unique of 0        49.676899
1        50.178635
2        55.017166
3        55.260582
4        52.140873
           ...
3308    980.000000
3309    980.000000
3310    973.719971
3311    987.450012
3312    992.000000
Name: Open, Length: 3313, dtype: float64>

In [324]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3313 entries, 0 to 3312
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       3313 non-null   object
 1   Open       3313 non-null   float64
 2   High       3313 non-null   float64
 3   Low        3313 non-null   float64
 4   Close      3313 non-null   float64
 5   Adj Close  3313 non-null   float64
 6   Volume     3313 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 181.3+ KB

In [325]:
type(df)

pandas.core.frame.DataFrame

- string 
- groupby